zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/driverlib/shamd5.c
    }
}


//*****************************************************************************
//
//! Reads the byte count of the current hashing operation.
//!
//!
//! \param ui32Base is the base address of the SHA/MD5 module.
//! \param count    points to the number of written bytes.
//! written.
//!
//! \return None.
//
//*****************************************************************************
void SHAMD5ReadDigestCount(uint32_t ui32Base, uint32_t *count)
{
	*count = HWREG(ui32Base + SHAMD5_O_DIGEST_COUNT);
}

//*****************************************************************************
//
//! Writes the byte count of the current hashing operation.
//!
//!
//! \param ui32Base is the base address of the SHA/MD5 module.
//! \param count    the number of written bytes.
//! written.
//!
//! \return None.
//
//*****************************************************************************
void SHAMD5WriteDigestCount(uint32_t ui32Base, uint32_t count)
{
	HWREG(ui32Base + SHAMD5_O_DIGEST_COUNT) = count;
}


//*****************************************************************************
//
//! Writes multiple words of data into the SHA/MD5 data registers.
//!
//! \param ui32Base is the base address of the SHA/MD5 module.
//! \param pui8DataSrc is a pointer to an array of data to be written.
//! \param ui32DataLength is the length of the data to be written in bytes.
//!
//! This function writes a variable number of words into the SHA/MD5 data
//! registers.  The function waits for each block of data to be processed
//! before another is written.
//!
//! \note This function is used by SHAMD5HashCompute(), SHAMD5HMACWithKPP(),
//! and SHAMD5HMACNoKPP() to process data.
//!
//! \return None.
//
//*****************************************************************************
void SHAMD5DataWriteMultiple(uint32_t ui32Base, uint8_t *pui8DataSrc, uint32_t ui32DataLength)
{
    uint32_t ui32Idx, ui32Count, ui32TempData=0, ui32Lastword;
    uint8_t * ui8TempData;


    //
    // Check the arguments.
    //
    ASSERT(ui32Base == SHAMD5_BASE);

    //
    // Wait for the module to be ready to accept data.
    //
    while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) & SHAMD5_INT_INPUT_READY) == 0)
    {
    }

    //
    // Calculate the number of blocks of data.
    //
    ui32Count = ui32DataLength / 64;

    //
    // Loop through all the blocks and write them into the data registers
    // making sure to block additional operations until we can write the
    // next 16 words.
    //
    for(ui32Idx = 0; ui32Idx < ui32Count; ui32Idx++)
    {
        //
        // Write the block of data.
        //
        SHAMD5DataWrite(ui32Base,pui8DataSrc);
        //
        // Increment the pointer to next block of data.
        //
        pui8DataSrc += 64;
    }

    //
    // Calculate the remaining bytes of data that don't make up a full block.
    //
    ui32Count = ui32DataLength % 64;

    //
    // If there are bytes that do not make up a whole block, then
    // write them separately.
    //
    if(ui32Count)
    {
        //
        // Wait until the engine has finished processing the previous block.
        //
        while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) &
               SHAMD5_INT_INPUT_READY) == 0)
        {
        }

        //
        // Loop through the remaining words.
        //
        ui32Count = ui32Count / 4;
        for(ui32Idx = 0; ui32Idx < ui32Count; ui32Idx ++)
        {
            //
            // Write the word into the data register.
            //
            HWREG(ui32Base + SHAMD5_O_DATA0_IN + (ui32Idx * 4)) =* ( (uint32_t *) pui8DataSrc);
            pui8DataSrc +=4;
        }
        //
        // Loop through the remaining bytes
        //
        ui32Count = ui32DataLength % 4;
        ui8TempData = (uint8_t *) &ui32TempData;
        if(ui32Count)
        {
        	ui32Lastword = 0;
        	if(ui32Idx)
        	{
        		ui32Lastword = (ui32Idx-1) *4;
        	}
        	for(ui32Idx=0 ; ui32Idx<ui32Count ; ui32Idx++)
        	{
        		*(ui8TempData+ui32Idx) = *(pui8DataSrc+ui32Idx);
        	}
        	HWREG(ui32Base + SHAMD5_O_DATA0_IN + ui32Lastword) = ui32TempData;
        }


    }
}

//*****************************************************************************
//
//! Compute a hash using the SHA/MD5 module.
//!
//! \param ui32Base is the base address of the SHA/MD5 module.
//! \param pui8DataSrc is a pointer to an array of data that contains the
//! data that will be hashed.
//! \param ui32DataLength specifies the length of the data to be hashed in
//! bytes.
//! \param pui8HashResult is a pointer to an array that holds the result
//! of the hashing operation.
//!
//! This function computes the hash of an array of data using the SHA/MD5
//! module.
//!
//! The length of the hash result is dependent on the algorithm that is in use.
//! The following table shows the correct array size for each algorithm:
//!
//! -----------------------------------------
//! | Algorithm | Number of Words in Result |
//! -----------------------------------------
//! | MD5       | 4 Words (128 bits)        |
//! | SHA-1     | 5 Words (160 bits)        |
//! | SHA-224   | 7 Words (224 bits)        |
//! | SHA-256   | 8 Words (256 bits)        |
//! -----------------------------------------
//!
//! \return None
//
//*****************************************************************************
bool
SHAMD5DataProcess(uint32_t ui32Base, uint8_t *pui8DataSrc,
                  uint32_t ui32DataLength, uint8_t *pui8HashResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Base == SHAMD5_BASE);
    ASSERT((ui32DataLength % 64) == 0);

    //
    // Wait for the context to be ready before writing the mode.
    //
    while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) & SHAMD5_INT_CONTEXT_READY) ==
          0)
    {
    }

    //
    // Write the length.
    //
    SHAMD5DataLengthSet(ui32Base, ui32DataLength);

    //
    // Write the data.
    //
    SHAMD5DataWriteMultiple(ui32Base, pui8DataSrc, ui32DataLength);

    //
    // Wait for the output to be ready.
    //
    while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) & SHAMD5_INT_OUTPUT_READY) ==
          0)
    {
    }

    //
    // Read the result.
    //
    SHAMD5ResultRead(ui32Base, pui8HashResult);

    //
    // Return true to indicate successful completion of the function.
    //
    return(true);
}

//*****************************************************************************
//
//! Compute a HMAC with key pre-processing using the SHA/MD5 module.
//!
//! \param ui32Base is the base address of the SHA/MD5 module.
//! \param pui8DataSrc is a pointer to an array of data that contains the
//! data that is to be hashed.
//! \param ui32DataLength specifies the length of the data to be hashed in
//! bytes.
//! \param pui8HashResult is a pointer to an array that holds the result
//! of the hashing operation.
//!
//! This function computes a HMAC with the given data using the SHA/MD5
//! module with a preprocessed key.
//!
//! The length of the hash result is dependent on the algorithm that is
//! selected with the \e ui32Algo argument.  The following table shows the
//! correct array size for each algorithm:
//!
//! -----------------------------------------
//! | Algorithm | Number of Words in Result |
//! -----------------------------------------
//! | MD5       | 4 Words (128 bits)        |
//! | SHA-1     | 5 Words (160 bits)        |
//! | SHA-224   | 7 Words (224 bits)        |
//! | SHA-256   | 8 Words (256 bits)        |
//! -----------------------------------------
//!
//! \return None
//
//*****************************************************************************
bool
SHAMD5HMACProcess(uint32_t ui32Base, uint8_t *pui8DataSrc,
                  uint32_t ui32DataLength, uint8_t *pui8HashResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Base == SHAMD5_BASE);

    //
    // Wait for the context to be ready before writing the mode.
    //
    while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) & SHAMD5_INT_CONTEXT_READY) ==
          0)
    {
    }

    //
    // Write the length.
    //
    SHAMD5DataLengthSet(ui32Base, ui32DataLength);

    //
    // Write the data in the registers.
    //
    SHAMD5DataWriteMultiple(ui32Base,pui8DataSrc, ui32DataLength);

    //
    // Wait for the output to be ready.
    //
    while((HWREG(ui32Base + SHAMD5_O_IRQSTATUS) & SHAMD5_INT_OUTPUT_READY) ==
          0)
    {
    }

    //
    // Read the result.
    //
    SHAMD5ResultRead(ui32Base, pui8HashResult);

    //
    // Return true to indicate successful completion of the function.
    //
    return(true);

